DataProcessors/ЗаписьНаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЗаписьНаУслуги</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗаписьНаУслуги/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаписатьсяНаСервере()
    
    ЗаписьКлиента = Документы.ЗаписьКлиента.СоздатьДокумент();
    ЗаписьКлиента.Дата        = НачалоМинуты(Объект.ДатаЗаписи);
    ЗаписьКлиента.Сотрудник = Объект.Сотрудник;
    
    СтрокаУслуги = ЗаписьКлиента.Услуги.Добавить();
    СтрокаУслуги.Услуга        = Объект.Услуга;
    СтрокаУслуги.Стоимость    = ЭтаФорма.Стоимость;
    
	ЗаписьКлиента.Записать();
	
	//Создаем JSON
	СтруктураРеквизитовДокумента = Новый Структура;
	СтруктураРеквизитовДокумента.Вставить("ДатаЗаписи", Объект.ДатаЗаписи);
	СтруктураРеквизитовДокумента.Вставить("Сотрудник", Строка(Объект.Сотрудник));
	СтруктураРеквизитовДокумента.Вставить("GUIDПользователя", ПараметрыСеанса.ТекущийПользователь.ВнешнийGUID);
	СтруктураРеквизитовДокумента.Вставить("Клиент",Строка(ПараметрыСеанса.ТекущийПользователь.Наименование)); 
	
	МассивУслуг = Новый Массив;
	
	Услуга = Новый Структура;
	Услуга.Вставить("Номенклатура", Строка(Объект.Услуга));
	Услуга.Вставить("Цена", ЭтаФорма.Стоимость);
	Услуга.Вставить("Количество", 1);
	Услуга.Вставить("Сумма", ЭтаФорма.Стоимость);
	
	МассивУслуг.Добавить(Услуга);
	СтруктураРеквизитовДокумента.Вставить("МассивУслуг", МассивУслуг);
	
	СтруктураРеквизитовДокументаJSON = ОбменСОсновнойБазой.ПолучитьТекстJSON(СтруктураРеквизитовДокумента);
	
	//Отправляем документ Запись в основную базу
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитовДокументаJSON);
	Если ДокументУспешноОтправлен Тогда        
	    ЗаписьКлиента.Записать(РежимЗаписиДокумента.Проведение);
	    
	    СообщениеПользователю = Новый СообщениеПользователю;
	    СообщениеПользователю.Текст = СтрШаблон("Вы записаны на услугу %1 к мастеру %2 на дату %3", 
	                                            Объект.Услуга, Объект.Сотрудник, Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'"));                                    
	    СообщениеПользователю.Сообщить();
	    
	    //Очистим реквизиты формы после успешной отправки документа
	    Объект.ДатаЗаписи    = '00010101';
	    Объект.Сотрудник    = Справочники.Сотрудники.ПустаяСсылка();
	    Объект.Услуга        = Справочники.Услуги.ПустаяСсылка();
	    ЭтаФорма.Стоимость  = 0;    
	Иначе    
	    СообщениеПользователю = Новый СообщениеПользователю;
	    СообщениеПользователю.Текст    = "Не удалось отправить Запись!";
	    СообщениеПользователю.Сообщить();
	КонецЕсли;    
    
КонецПроцедуры

&НаКлиенте
Процедура Записаться(Команда)
    ЗаписатьсяНаСервере();
КонецПроцедуры

&НаСервере
Процедура УслугаПриИзмененииНаСервере()
    ЭтаФорма.Стоимость = Объект.Услуга.Стоимость;
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
    УслугаПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущийП = ПараметрыСеанса.ТекущийПользователь.Наименование;
КонецПроцедуры
